# เขียนโปรแกรม รับชื่ือ อายุ ทางแป้นพิมพ์ แล้วแสดงผลออกมาว่า ชื่อ อายุนั้น เป็น เด็ก คนหนุ่ม หรือคนแก่
# อายุน้อยกว่า 20 คือ เด็ก /อายุ 20-45 คนหนุ่ม /46 ขึ้นคือคนแก่

# หาฟีเจอร์การทำงาน เพื่อจะเอาไปเขียนขึ้นฟังก์ชัน
# ฟีเจอร์  รับคำข้อมูล , ตรวจสอบและแสดงผลเป็น เด็ก คนหนุ่ม หรือคนแก่ , แสดงชื่อโปรแกรม

def showProgramName( ) :
    print(' **--โปรแกรมตรวจสอบความเป็นเด็ก หนุ่ม คนแก่**')

def inputData( ) :
    name = input('ป้อนชื่อ : ')
    age = input('ป้อนอายุ : ')
    return name, age

def CSS(name, age) :
    if age <= "18" :
        print(f'ท่าน{name} อายุ {age} ปี เป็นเด็ก')
    elif age >= "19" and age <= 45 :
        print(f'ท่าน{name} อายุ {age} ปี เป็นคนหนุ่ม')
    else :
        print(f'ท่าน{name} อายุ {age} ปี เป็นคนแก่')

print('---------------------------------------')
showProgramName( )
print('---------------------------------------')
name, age = inputData( )
print('---------------------------------------')
CSS(name, age)
print('---------------------------------------')
